v13/advection-diffusion/advection-diffusion-1D/0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    left
    {
        type            fixedValue;
        value           uniform 0;
    }
    right
    {
        type            fixedValue;
        value           uniform 0;
    }
    top
    {
        type            empty;
    }
    bottom
    {
        type            empty;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
